<template>
    <div>
        <swiper class="swiper" :options="swiperOption">
            <swiper-slide class="text">
                <div>
                    山东半岛濒临黄渤海，海域资源丰富，具有发展海洋科技和产业的有利条件。12日上午，
                    习近平来到位于青岛蓝谷的青岛海洋科学与技术试点国家实验室。习近平走进实验室大楼，
                    结合展板、电子屏、实物模型和样品标本展示，听取实验室在开发利用海洋资源能源、
                    服务海洋经济发展、保护海洋生态环境以及构建综合立体海洋观测网络等方面的情况介绍，
                    了解深远海科考船队共享平台建设和科考船工作情况。在超算仿真大厅，习近平认真察看高性
                    能科学计算和系统仿真平台运行情况，并向科研人员详细询问构建超级计算机互联网、研发人
                    工智能和大数据系统“深蓝大脑”、打造国家一流海洋系统模拟器的最新进展。得知超级计算机
                    解决了海洋数据“碎片化”问题，大大提高了海洋观测和预测能力，总书记十分高兴。海洋高端
                    装备联合实验室内，水下仿生机器鱼、无人水面船、海洋传感器等具有自主知识产权和核心关
                    键技术的海洋仪器设备吸引了总书记目光，他走上前去凝神察看，不时询问。听说总书记来了，
                    实验室的科研人员纷纷围聚过来，向总书记问好。习近平强调，海洋经济发展前途无量。
                    建设海洋强国，必须进一步关心海洋、认识海洋、经略海洋，加快海洋科技创新步伐。
                    他勉励大家，再接再厉，创造辉煌。随后，习近平来到青岛市李沧区上流佳苑社区。在社区市民中心，
                    他听取青岛市城市发展规划建设和旧城风貌保护情况汇报，察看村史馆内旧村老屋复原场景，
                    了解社区实施旧城改造、加强基层党建以及居民生活变化情况。中午时分，习近平走进社区便民食堂，
                    同正在这里用餐的居民热情交谈，询问饭菜可不可口、价格贵不贵、对社区便民服务还有什么新要求。习近平还沿着小道
                    步入社区，察看社区整体环境和居民居住情况。社区小广场上，一些居民正在健身休闲，看到总书记来了，大家热情鼓
                    起掌来。习近平走到他们身边，向大家问好。习近平强调，城市是人民的城市，要多打造市民休闲观光、健身活动的地点，
                    让人民群众生活更方便、更丰富多彩。要推动社会治理重心向基层下移，把更多资源、服务、管理放到社区，更好为社
                    区居民提供精准化、精细化服务。离开社区时，路旁挤满了群众，习近平频频挥手，向大家致意。下午，
                    习近平来到胶东（威海）党性教育基地刘公岛教学区。习近平登上东泓炮台遗址，
                    了解北洋海军威海卫基地防务情况和威海卫保卫战、刘公岛保卫战历史。随后，习近平来到甲午战争博物馆陈列馆，
                    参观甲午战争史实展。习近平听取了威海市依托红色资源打造党性教育基地情况介绍。
                    在刘公岛教学区培训的学员代表和博物馆工作人员代表，以热烈掌声欢迎总书记的到来。
                    习近平语重心长地说，我一直想来这里看一看，受受教育。要警钟长鸣，铭记历史教训，13亿多中国人要发愤图强，
                    把我们的国家建设得更好更强大。
                    夕阳洒向海滨，青山格外秀美。接近傍晚时分，习近平考察了华夏集团生态修复项目。这个曾经满目疮痍的采石场，
                    经过十多年的综合治理、绿化造林，如今到处鸟语花香、满眼郁郁葱葱。习近平在听取威海市生态文明建设整体情况介绍后，
                    沿着步行道实地察看治理区新貌，同当年参与矿山修复和目前正在景区工作的村民亲切交谈，对华夏集团通过生态修
                    复促进文化旅游发展、带动周边村民就业致富的做法给予肯定。习近平强调，良好生态环境是经济社会持续健康发展的重要基础，
                    要把生态文明建设放在突出地位，把绿水青山就是金山银山的理念印在脑子里、落实在行动上，统筹山水林田湖草系统治理，
                    让祖国大地不断绿起来、美起来。海风萧萧，烟雨蒙蒙。13日上午，习近平冒雨来到位于山东半岛北
                    端的蓬莱市，这里曾经是古代海上丝绸之路的一个起点。习近平拾阶而上，登上蓬莱阁主阁，远眺
                    黄渤海分界线，俯瞰蓬莱水城，了解古代海上丝绸之路情况，察看水城炮台和古代舰船入海口，
                    听取明代爱国将领戚继光操练水师、保卫海防等历史介绍。习近平指出，我国古代史、近代史、现
                    代史构成了中华民族的丰富历史画卷。领导干部要多读一点历史，从历史中汲取更多精神营养。要
                    加强国家重点文物保护，让优秀文物世代相传。
                </div>
            </swiper-slide>
        </swiper>
    </div>
</template>

<script>
    import 'swiper/dist/css/swiper.css'
    import {swiper,swiperSlide} from 'vue-awesome-swiper'
    export default {
        data() {
            return {
                swiperOption: {
                    direction:'vertical',
                    slidesPerView:'auto',
                    freeMode:true,
                    mousewheel:true
                }
            }
        },
        components:{
            swiper,
            swiperSlide
        }
    }
</script>

<style scoped>
    .swiper{
        height: 300px;
        overflow: hidden;
    }
    .text{
        font-size: 18px;
        text-align: left;
        padding: 30px;
        height: auto;
        -webkit-box-sizing: border-box;
        box-sizing: border-box;

    }
</style>